#+TITLE: See Grades
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+STARTUP: showeverything

* Instructions
  In the Gradebook table below, your weighted scores are calculable with an
  org-mode table formula. Put your cursor on the "#+tblfm:" line at the bottom
  of the table and type , , (two commas) to update these weighted scores after
  changing any raw score. You are welcome to change any scores and play \ldquo{}what
  if\rdquo with your grade, but your official scores will need to be merged in when
  you \ldquo{}git pull\rdquo from the grading branch, which is where edits will be made by
  me or my graders.

  The source code blocks just below and at the bottom of this file will tell you
  your letter grade once you know how to use them.

#+BEGIN_SRC emacs-lisp :results silent
  (defun compute-final-grade (grades)
    "Compute weighted percentage and convert to letter grade, returning both."
    (let* ((weighted-percentage (apply '+ (mapcar 'fifth grades)))
           (number (ceiling weighted-percentage))
           (tensDigit (/ number 10))
           (onesDigit (mod number 10))
           (index (min (max (- tensDigit 5) 0) 4))
           (letter (substring "FDCBA" index (+ index 1)))
           (sign (if (<= onesDigit 2) "-" (if (>= onesDigit 7) "+")))
           (letter-grade (concat letter (if (and (< number 95) (>= number 60)) sign))))
      (list (format "%2.2f" weighted-percentage) letter-grade)))
#+END_SRC

  Note: All raw scores are normalized to 100 total possible.

* Gradebook                                                           :crypt:
  :PROPERTIES:
  :CRYPTKEY: NeffR@byui.edu
  :END:
#+tblname: grades-as-table
| Grade Item       |          Raw Score | Timeliness | Weight | Weighted Score |
|------------------+--------------------+------------+--------+----------------|
| [[file:00-ponder--prove.org][00 Ponder--Prove]] |                235 |        1.0 |    2.5 |          5.875 |
| [[file:../week01/01-prepare-teach.org][01 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week01/01-ponder--prove.org][01 Ponder--Prove]] | 106.38095238095238 |        1.0 |    2.5 |      2.6595238 |
| [[file:../week02/02-prepare-teach.org][02 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week02/02-ponder--prove.org][02 Ponder--Prove]] |                436 |        1.0 |    3.0 |          13.08 |
| [[file:../week03/03-prepare-teach.org][03 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week03/03-ponder--prove.org][03 Ponder--Prove]] |                231 |        1.0 |    3.5 |          8.085 |
| [[file:../week04/04-prepare-teach.org][04 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week04/04-ponder--prove.org][04 Ponder--Prove]] |                366 |        1.0 |    4.0 |          14.64 |
| [[file:../week05/05-prepare-teach.org][05 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week05/05-ponder--prove.org][05 Ponder--Prove]] |                331 |        1.0 |    4.5 |         14.895 |
| [[file:../week06/06-prepare-teach.org][06 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week06/06-ponder--prove.org][06 Ponder--Prove]] |                239 |        1.0 |    5.0 |          11.95 |
| [[file:../week07/07-prepare-teach.org][07 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week07/07-ponder--prove.org][07 Ponder--Prove]] |                100 |        1.0 |    5.5 |            5.5 |
| [[file:../week08/08-prepare-teach.org][08 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week08/08-ponder--prove.org][08 Ponder--Prove]] |                100 |        1.0 |    6.0 |             6. |
| [[file:../week09/09-prepare-teach.org][09 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week09/09-ponder--prove.org][09 Ponder--Prove]] |                100 |        1.0 |    7.0 |             7. |
| [[file:../week10/10-prepare-teach.org][10 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week10/10-ponder--prove.org][10 Ponder--Prove]] |                100 |        1.0 |    8.0 |             8. |
| [[file:../week11/11-prepare-teach.org][11 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week11/11-ponder--prove.org][11 Ponder--Prove]] |                100 |        1.0 |    8.5 |            8.5 |
| [[file:../week12/12-prepare-teach.org][12 Prepare-Teach]] |                100 |        1.0 |    2.5 |            2.5 |
| [[file:../week12/12-ponder--prove.org][12 Ponder--Prove]] |                100 |        1.0 |   10.0 |            10. |
#+tblfm: $5=$2*$3*$4/100

#+BEGIN_SRC emacs-lisp :var grades=grades-as-table
(compute-final-grade grades)
#+END_SRC

#+RESULTS:
| 146.18 | A |

* Decrypt
#+BEGIN_SRC emacs-lisp :results silent
  (require 'org-crypt)
  (org-decrypt-entries)
#+END_SRC
